{
  "name": "Page 1",
  "level": 1,
  "start_page": 1,
  "end_page": 1,
  "total_pages": 1,
  "content": "August 27, 2025 \n1 \nSummary of Changes: NIST SP 800-53 Release 5.2.0 \nNIST Special Publication (SP) 800-53 Release 5.2.0, Security and Privacy Controls for Information \nSystems and Organizations, is available.  This revision focuses on improving the security and \nreliability of software updates and patches in response to Executive Order 14306 on strengthening \nthe Nation’s cybersecurity.  \nSP 800-53 Release 5.2.0 addresses multiple aspects of the software development and deployment \nprocess, including software and system resiliency by design, developer testing, the deployment \nand management of updates, and software integrity and validation. This update also revises the \ndiscussion sections of some existing controls to provide additional scoping and implementation \nexamples. A detailed list of changes is included below in Table 1.  \nNIST SP 800-53A Release 5.2.0, Assessing Security and Privacy Controls in Information Systems \nand Organizations, includes updates to assessment procedures for new or revised control and \ncontrol requirements.  NIST SP 800-53B Release 5.2.0, Control Baselines for Information Systems \nand Organizations, has no changes; the version number was updated for consistency with SP 800-\n53 and SP 800-53A.   \nTable 1. Changes in NIST SP 800-53 Release 5.2.0 \nControl / Control Enhancement \nDescription of Change \nNew Control/Control Enhancement and Assessment Procedure \nSA-15(13) Development \nProcess, Standards, and Tools | \nLogging Syntax \nNew Control Enhancement to address more clear \nrequirements for logging. \nControl enhancement not included in any SP 800-53B \nbaseline. \nSA-24, Design for Cyber Resiliency \nNew in final based on stakeholder feedback. \nAdded to address cyber resiliency by design. \nControl not included in any SP 800-53B baseline. \nSI-02(07) Flaw Remediation | Root \nCause Analysis \nNew control enhancement to address conducting a root \ncause analysis. \nIdentified as a gap from analysis of the NIST SSDF. \nControl enhancement not included in any SP 800-53B \nbaseline.  \nRevision to Existing Control Requirement \nSI-07(12) \nRevised existing control enhancement to address all \norganization-defined software instead of only \norganization-defined user software.   \nControl enhancement not included in any SP 800-53B \nbaseline. \nUpdate to Existing Control/Control Enhancement Discussion \nChange to discussion does not impact control requirement. \n",
  "extraction_method": "per_page_fallback"
}